In [17]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime 
import ast
import json

In [18]:
pd.set_option('display.max_colwidth', None)

In [19]:
dfproduction= pd.read_csv(r'C:\Users\flori\Desktop\DATA SCIENCE\LABS\Trabajos\Proyecto_Indiv_1_MLO_Henry\ETL\Production.csv')
dfproduction.head()

,id,production_companies,production_countries
0,862,"[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'iso_3166_1': 'US', 'name': 'United States of America'}]"
1,15602,"[{'name': 'Warner Bros.', 'id': 6194}, {'name': 'Lancaster Gate', 'id': 19464}]","[{'iso_3166_1': 'US', 'name': 'United States of America'}]"
2,11862,"[{'name': 'Sandollar Productions', 'id': 5842}, {'name': 'Touchstone Pictures', 'id': 9195}]","[{'iso_3166_1': 'US', 'name': 'United States of America'}]"
3,710,"[{'name': 'United Artists', 'id': 60}, {'name': 'Eon Productions', 'id': 7576}]","[{'iso_3166_1': 'GB', 'name': 'United Kingdom'}, {'iso_3166_1': 'US', 'name': 'United States of America'}]"
4,21032,"[{'name': 'Universal Pictures', 'id': 33}, {'name': 'Amblin Entertainment', 'id': 56}, {'name': 'Amblimation', 'id': 4105}]","[{'iso_3166_1': 'US', 'name': 'United States of America'}]"

In [20]:
def convertir_columna_diccionarios_a_dataframe(df, columna):
    # Obtener la columna que contiene los diccionarios
    column_data = df[columna]

    # Convertir los diccionarios a listas de diccionarios
    lista_diccionarios = column_data.apply(lambda x: eval(x) if pd.notna(x) else [])

    # Filtrar y eliminar los valores booleanos
    lista_diccionarios = [d for sublist in lista_diccionarios if isinstance(sublist, list) for d in sublist]

    # Crear el DataFrame resultante y seleccionar las columnas deseadas
    df_estudio = pd.DataFrame(lista_diccionarios, columns=['id', 'name'])

    return df_estudio

# Aplicar la funci√≥n al DataFrame y obtener el DataFrame resultante
df_estudio = convertir_columna_diccionarios_a_dataframe(dfproduction, 'production_companies')

# Mostrar las primeras filas del DataFrame resultante
df_estudio.head()

      id                     name
0      3  Pixar Animation Studios
1   6194             Warner Bros.
2  19464           Lancaster Gate
3   5842    Sandollar Productions
4   9195      Touchstone Pictures

In [22]:
df_estudio.to_csv('EstudiosFinal.csv', index=False)

In [21]:
def convertir_columna_diccionarios_a_dataframe(df, columna):
    # Obtener la columna que contiene los diccionarios
    column_data = df[columna]

    # Convertir los diccionarios a listas de diccionarios
    lista_diccionarios = column_data.apply(lambda x: eval(x) if pd.notna(x) else [])

    # Filtrar y eliminar los valores booleanos
    lista_diccionarios = [d for sublist in lista_diccionarios if isinstance(sublist, list) for d in sublist]

    # Crear el DataFrame resultante y seleccionar las columnas deseadas
    df_pais = pd.DataFrame(lista_diccionarios, columns=['iso_3166_1', 'name'])

    return df_resultado

# Aplicar la funci√≥n al DataFrame y obtener el DataFrame resultante
df_pais = convertir_columna_diccionarios_a_dataframe(dfproduction, 'production_countries')

# Mostrar las primeras filas del DataFrame resultante
df_pais.head()

  iso_3166_1                      name
0         US  United States of America
1         US  United States of America
2         US  United States of America
3         GB            United Kingdom
4         US  United States of America

In [23]:
df_pais.to_csv('PaisFinal.csv', index=False)